<script setup>
import { computed, onMounted } from 'vue'
import { useRoute } from 'vue-router'
import { useUserStore } from './store/userStore'
import { auth } from './firebase'
import { onAuthStateChanged } from 'firebase/auth'
import MenuItem from '@/components/pages/MenuItem.vue'
const route = useRoute()

const isHomePage = computed(() => {
  return route.path === '/'
})

const userStore = useUserStore()

onMounted(() => {
  // Добавляем слушатель состояния аутентификации
  onAuthStateChanged(auth, (user) => {
    if (user) {
      // Если пользователь авторизован, сохраняем данные пользователя в Pinia
      userStore.setUser(user)
    } else {
      // Если пользователь не авторизован, очищаем состояние
      userStore.clearUser()
    }
    // Вызываем метод для завершения загрузки
    userStore.loading = false
  })
  userStore.initAuthState()
})
</script>

<template>
  <nav>
    <div class="logo">
      <img v-if="isHomePage" src="@/assets/happy_gnom.png" alt="Happy Gnom" />
      <img v-else src="@/assets/angry_gnom.png" alt="Angry Gnom" />
    </div>
    <div class="links">
      <MenuItem to="/">
        <svg
          viewBox="0 0 44 44"
          fill="#000000"
          xmlns="http://www.w3.org/2000/svg"
          stroke-width="0px"
        >
          <path
            d="M21.1062 9.928C21.2112 9.717 21.3872 9.551 21.6032 9.457C21.8192 9.364 22.0612 9.35 22.2872 9.417L22.4012 9.459L30.4012 12.959C30.5832 13.039 30.7372 13.171 30.8442 13.339L30.9022 13.442L36.9022 25.942C36.9502 26.043 36.9822 26.152 36.9942 26.263L37.0002 26.375V35.375C37.0002 35.62 36.9102 35.856 36.7472 36.039C36.5852 36.223 36.3602 36.339 36.1172 36.368L36.0002 36.375H8.00023C7.86223 36.375 7.72523 36.346 7.59923 36.291C7.47223 36.236 7.35923 36.155 7.26523 36.053C7.17123 35.952 7.10023 35.832 7.05523 35.702C7.00923 35.571 6.99223 35.433 7.00323 35.295L7.01923 35.179L10.0192 20.179C10.0512 20.02 10.1212 19.87 10.2242 19.744C10.3272 19.618 10.4592 19.519 10.6092 19.455L10.7252 19.413L17.3022 17.534L21.1062 9.928ZM22.4692 11.672L18.8942 18.822C18.7872 19.036 18.6072 19.204 18.3872 19.297L18.2752 19.337L11.8612 21.168L11.0192 25.375H14.0002V27.375H10.6192L9.21923 34.375H15.9992L16.0002 32.375C16.0002 30.823 16.6022 29.331 17.6782 28.213C18.7552 27.094 20.2242 26.437 21.7752 26.379L22.0002 26.375C23.5522 26.375 25.0442 26.977 26.1622 28.053C27.2812 29.13 27.9382 30.599 27.9962 32.15L28.0002 32.375V34.375H35.0002V26.603L34.4102 25.375H30.0002V23.375H33.4502L32.0002 20.352V20.375H25.0002V18.375H31.0502L29.2602 14.642L22.4702 11.672H22.4692ZM22.0002 28.375C20.9742 28.375 19.9872 28.77 19.2432 29.477C18.5002 30.184 18.0562 31.15 18.0052 32.175L18.0002 32.375V34.375H26.0002V32.375C26.0002 31.384 25.6322 30.428 24.9682 29.693C24.3032 28.957 23.3892 28.495 22.4032 28.395L22.2002 28.38L22.0002 28.375Z"
            fill="#3C3C3C"
          ></path>
        </svg>
      </MenuItem>
      <MenuItem v-if="userStore.user" to="/materials">
        <svg
          viewBox="0 0 512 512"
          xmlns="http://www.w3.org/2000/svg"
          fill="#000000"
          stroke-width="0px"
        >
          <path
            d="M303.2 19.338l-161.966 93.51 93.512 161.966 161.967-93.51-4.674-8.093-4.874-8.44-4.127-7.54-.188.07-79.65-137.962zm-20.62 33.486l-50.27 90.14c-19.184-7.687-37.887-17.28-56.165-28.69l106.435-61.45zm19.914 2.664l63.235 109.528c-40.568 2.1-78.993-3.29-115.658-15.536l52.422-93.992zm-251.61 25.68L23.032 167.99l74.302 51.123 27.854-86.822-5.723-3.936-68.578-47.186zm10.118 29.646l32.295 22.22-44.233 14.99 11.938-37.21zm385.836 22.33l-46.143 17.418 9.06 16.557 20.165-7.614 2.992 43.463-39.94 15.077-.878-12.748-18.016 10.4 1.977 28.71 76.457-28.865-5.674-82.402zm-270.55 3.045c31.896 18.617 65.316 32.12 100.267 39.964l-39.52 65.25L176.29 136.19zm-76.604 14.414l-12.467 38.863-33.73-23.207 46.197-15.656zm196.437 29.318c19.028 3.07 38.496 4.478 58.403 4.158l-93.675 54.084 35.273-58.242zM21.187 224.744l1.96 14.336 21.672 158.522 167.026 49.484-1.994-14.59-23.522-12.463L79.99 388.53l59.563-26.098 34.398-54.528 6.943 50.77 16.082-20.33-8.766-64.114-167.024-49.486zm22.435 26.14l121.497 35.997-38.314 60.733-66 28.92-17.182-125.65zm313.064 5.206l-88.914 23.824-1.916 2.395-89.266 111.594 197.365 102.963 118.662-187.66-135.93-53.117zm-13.6 22.988l31.3 55.317-86.09 22.673 2.505-63.978 52.284-14.012zm21.582.193l88.18 34.46-59.778 15.743-28.402-50.202zm-93.035 25.734l-2.232 57.04-54.978 14.48 57.21-71.52zm184.313 27.234l-73.545 116.31 13.94-100.61 59.605-15.7zm-79.185 20.856L362.762 454.11l-67.342-79.594 81.338-21.422zM275.402 379.79l67.532 79.817-124.325-64.86 56.792-14.958z"
          ></path>
        </svg>
      </MenuItem>
      <MenuItem v-if="userStore.user" to="/products">
        <svg
          fill="#000000"
          version="1.1"
          id="Capa_1"
          xmlns="http://www.w3.org/2000/svg"
          xmlns:xlink="http://www.w3.org/1999/xlink"
          viewBox="0 0 59.508 59.508"
          xml:space="preserve"
        >
          <path
            d="M11.417,30.753c1.015,0,2.019-0.142,2.994-0.404l5.614,5.614L9.334,46.654c-0.188,0.188-0.293,0.442-0.293,0.707 s0.105,0.521,0.293,0.707l6.625,6.624c0.195,0.195,0.451,0.293,0.707,0.293c0.256,0,0.512-0.098,0.707-0.293L28.063,44 l10.153,10.151c0.188,0.188,0.441,0.293,0.707,0.293c0.265,0,0.52-0.104,0.707-0.293l6.624-6.625c0.391-0.391,0.391-1.022,0-1.414 L36.103,35.963l8.187-8.187c0.392-0.391,0.392-1.023,0-1.414l-0.955-0.955l3.033-3.032l4.809,4.807 c0.194,0.195,0.45,0.293,0.707,0.293c0.256,0,0.512-0.098,0.707-0.293l6.625-6.624c0.188-0.188,0.293-0.442,0.293-0.707 s-0.105-0.52-0.293-0.707L44.885,4.815c-0.267-0.266-0.661-0.359-1.02-0.243L38.88,6.21c-0.303,0.099-0.539,0.336-0.639,0.638 l-1.638,4.986c-0.118,0.358-0.023,0.752,0.243,1.019l4.808,4.808l-3.032,3.032l-0.955-0.955c-0.375-0.375-1.038-0.375-1.413,0 l-8.188,8.187l-5.629-5.629c1.067-3.954-0.006-8.135-2.92-11.049C17.359,9.089,14.489,7.9,11.436,7.9 c-1.12,0-2.23,0.163-3.3,0.484C7.799,8.485,7.54,8.756,7.454,9.097C7.368,9.438,7.468,9.8,7.717,10.048l3.044,3.045l1.285,4.209 l-2.639,2.639l-4.212-1.284L2.15,15.613c-0.249-0.249-0.611-0.348-0.951-0.263c-0.341,0.086-0.612,0.345-0.713,0.682 c-1.214,4.041-0.117,8.402,2.862,11.381C5.501,29.567,8.367,30.753,11.417,30.753z M39.982,7.952l3.921-1.289L57.092,19.85 l-5.21,5.21L38.693,11.873L39.982,7.952z M34.688,37.376l9.444,9.444l-5.21,5.21l-9.445-9.443l2.403-2.402L34.688,37.376z M43.066,19.074l1.886,1.886l-3.032,3.032l-1.887-1.886L43.066,19.074z M36.957,21.859l0.955,0.955l3.301,3.3l0.954,0.955 L30.41,38.826l-3.054,3.055c0,0,0,0,0,0.001l-10.69,10.689l-5.21-5.21l10.691-10.69l6.625-6.624c0,0,0-0.001,0.001-0.001 L36.957,21.859z M21.439,34.549l-4.964-4.966c0.311-0.15,0.611-0.318,0.904-0.496c0.067-0.041,0.131-0.087,0.198-0.129 c0.272-0.173,0.536-0.358,0.792-0.554c0.086-0.066,0.172-0.131,0.256-0.2c0.306-0.249,0.605-0.508,0.888-0.791 c0.282-0.282,0.542-0.581,0.791-0.888c0.068-0.084,0.134-0.171,0.2-0.257c0.196-0.256,0.38-0.52,0.553-0.792 c0.042-0.067,0.089-0.131,0.13-0.199c0.178-0.293,0.346-0.594,0.497-0.904l4.965,4.965L21.439,34.549z M2.051,18.343l1.906,1.905 c0.116,0.116,0.258,0.202,0.415,0.25l5.022,1.533c0.354,0.107,0.738,0.012,0.999-0.25l3.489-3.489 c0.261-0.261,0.357-0.646,0.25-0.999l-1.533-5.021c-0.048-0.157-0.134-0.299-0.25-0.415l-1.904-1.905 c2.82-0.294,5.641,0.695,7.655,2.709c2.529,2.529,3.401,6.218,2.277,9.628c-0.468,1.418-1.234,2.667-2.277,3.71 c-0.261,0.261-0.534,0.504-0.82,0.73c-0.857,0.677-1.826,1.196-2.89,1.547l0,0c-0.96,0.316-1.959,0.476-2.972,0.476 c-2.516,0-4.879-0.979-6.656-2.754C2.726,23.963,1.756,21.145,2.051,18.343z"
          ></path>
          <path
            d="M15.296,49.227c-0.391,0.391-0.391,1.022,0,1.414c0.195,0.194,0.451,0.293,0.707,0.293c0.256,0,0.512-0.099,0.707-0.293 l13.877-13.877c0.391-0.392,0.391-1.023,0-1.414c-0.391-0.392-1.023-0.392-1.414,0L15.296,49.227z"
          ></path>
        </svg>
      </MenuItem>
    </div>
  </nav>
  <main class="main">
    <div class="container">
      <RouterView />
    </div>
  </main>
</template>

<style lang="scss">
:root {
  --main-color: #c8b08f;
  --accent-color: #d4af37;
  --bg-color: #f0e6d2;
  --text-color: #4a3c31;

  --border: 1px solid #8c7a64;

  --button-color: #8c7a64;
  --hover-color: #a08f77;

  --columns-x-large: 4;
  --columns-large: 3;
  --columns-medium: 2;
  --columns-small: 1;
  --gap: 10px;
}
* {
  margin: 0;
  padding: 0;
  box-sizing: border-box;
}

#app {
  font-family: Avenir, Helvetica, Arial, sans-serif;
  -webkit-font-smoothing: antialiased;
  -moz-osx-font-smoothing: grayscale;
  display: flex;
  flex-direction: row;
  text-align: start;
  font-size: 16px;
  background: var(--bg-color);
  color: var(--text-color);
}
.main {
  background: var(--bg-color);
}
.container {
  // width: clamp(320px, 100%, 1440px);
  margin: 0 auto;
  padding: 0 20px;
  box-sizing: border-box;
}

nav {
  width: 100%;
  max-width: 60px;
  height: 100dvh;
  padding-inline: 10px;
  display: flex;
  flex-direction: column;
  justify-content: start;
  gap: 25px;
  .logo {
    padding-block: 20px;
    img {
      width: 100%;
      max-width: 100%;
      height: auto;
    }
  }
  .links {
    display: flex;
    flex-direction: column;
    gap: 15px;
    a {
      display: flex;
      align-self: center;
      &:first-child {
        svg {
          width: 52px;
        }
      }
      &.router-link-exact-active {
        svg {
          path {
            fill: var(--accent-color);
          }
        }
      }
    }
    svg {
      width: 46px;
      fill: var(--text-color);
      stroke: transparent;
      transition: stroke 0.3s ease;
      &:hover {
        stroke: var(--accent-color);
      }
    }
  }
  a {
    font-weight: bold;
    color: #7da0c4;
    &.router-link-exact-active {
      color: #42b983;
    }
  }
}

ul {
  list-style-type: none;
  padding: 0;
  margin: 0;
}

input {
  padding: 10px;
  border: 1px solid #8c7a64;
  border-radius: 5px;
  background-color: #e8dcc7;
  color: #4a3c31;
  margin-bottom: 10px;
}

select {
  padding: 10px;
  font-size: 16px;
  border: var(--border);
  border-radius: 5px;
  background-color: #f0e6d2;
  color: #4a3c31;
}

button {
  width: 100%;
  padding: 10px 0;
  margin: 0;
  font-size: 1rem;
  color: #ffffff;
  background-color: var(--button-color);
  border: var(--border);
  border-radius: 5px;
  cursor: pointer;
  box-shadow: 2px 2px 4px rgba(0, 0, 0, 0.3);
  transition: all 0.3s ease;
  &:hover {
    background-color: var(--hover-color);
    box-shadow: 0 0 10px var(--accent-color);
  }
}
</style>
